# Imports needed to complete this assignment

In [2]:
!pip install pandas

Requirement already satisfied: pandas in e:\anaconda\lib\site-packages (1.1.3)
Requirement already satisfied: numpy>=1.15.4 in e:\anaconda\lib\site-packages (from pandas) (1.19.2)
Requirement already satisfied: python-dateutil>=2.7.3 in e:\anaconda\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: pytz>=2017.2 in e:\anaconda\lib\site-packages (from pandas) (2020.1)
Requirement already satisfied: six>=1.5 in e:\anaconda\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)

In [3]:
! pip install PyMySQL

Requirement already satisfied: PyMySQL in e:\anaconda\lib\site-packages (1.0.2)

In [4]:
import pandas as pd

In [5]:
print(pd.__version__)

1.1.3

#Write code to load the alumni csv dataset into a Pandas DataFrame called 'alumni'.

In [6]:
alumni = pd.read_csv( "C://Users//user//Documents//jupyter assignments//Assignments//alumni.csv")
alumni

,Year Graduated,Gender,Marital Status,Diploma Type,Defaulted,Salary,Fee,Savings ($)
0,2004,Male,Single,Standard Diploma,Yes,125000,10869,"$86,000"
1,2005,Male,Married,College Prep Diploma,No,100000,10869,"$116,000"
2,2006,Female,Single,Standard Diploma,Yes,70000,10869,"$52,000"
3,2007,Male,Married,Standard Diploma,No,120000,10869,"$76,000"
4,2006,Female,Divorced,Standard Diploma,Yes,95000,11948,"$52,000"
...,...,...,...,...,...,...,...,...
83,2007,Male,Single,Standard Diploma,No,75000,12066,"$16,000"
84,2008,M,Single,College Prep Diploma,Yes,65000,12066,"$72,000"
85,2009,Male,Married,Standard Diploma,No,75000,12066,"$46,000"
86,2005,Female,Divorced,Standard Diploma,Yes,100000,12067,"$32,000"
87,2006,Male,Married,Standard Diploma,Yes,75000,12067,"$67,000"

#Question 2 : Understand the data set (5 Marks)
Use the following pandas commands to understand the data set: a) head, b) tail, c) dtypes, d) info, e) describe

#a) head

In [7]:
alumni.head(5)

,Year Graduated,Gender,Marital Status,Diploma Type,Defaulted,Salary,Fee,Savings ($)
0,2004,Male,Single,Standard Diploma,Yes,125000,10869,"$86,000"
1,2005,Male,Married,College Prep Diploma,No,100000,10869,"$116,000"
2,2006,Female,Single,Standard Diploma,Yes,70000,10869,"$52,000"
3,2007,Male,Married,Standard Diploma,No,120000,10869,"$76,000"
4,2006,Female,Divorced,Standard Diploma,Yes,95000,11948,"$52,000"

#b) tail

In [8]:
alumni.tail(11)

,Year Graduated,Gender,Marital Status,Diploma Type,Defaulted,Salary,Fee,Savings ($)
77,2006,Female,Married,Standard Diploma,No,65000,11335,"$46,000"
78,2007,Male,Divorced,Standard Diploma,Yes,75000,11335,"$32,000"
79,2008,Female,Married,Standard Diploma,No,110000,11335,"$50,000"
80,2009,Female,Divorced,Standard Diploma,Yes,75000,11335,"$19,000"
81,2005,Female,Single,Standard Diploma,Yes,90000,12066,"$16,000"
82,2006,Male,Married,College Prep Diploma,No,65000,12066,"$37,000"
83,2007,Male,Single,Standard Diploma,No,75000,12066,"$16,000"
84,2008,M,Single,College Prep Diploma,Yes,65000,12066,"$72,000"
85,2009,Male,Married,Standard Diploma,No,75000,12066,"$46,000"
86,2005,Female,Divorced,Standard Diploma,Yes,100000,12067,"$32,000"
87,2006,Male,Married,Standard Diploma,Yes,75000,12067,"$67,000"

c) dtypes

In [9]:
alumni.dtypes

Year Graduated     int64
Gender            object
Marital Status    object
Diploma Type      object
Defaulted         object
Salary             int64
Fee                int64
Savings ($)       object
dtype: object

d) info

In [10]:
alumni.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 88 entries, 0 to 87
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Year Graduated  88 non-null     int64
 1   Gender          88 non-null     object
 2   Marital Status  88 non-null     object
 3   Diploma Type    88 non-null     object
 4   Defaulted       88 non-null     object
 5   Salary          88 non-null     int64
 6   Fee             88 non-null     int64
 7   Savings ($)     88 non-null     object
dtypes: int64(3), object(5)
memory usage: 5.6+ KB

e) describe

In [11]:
alumni.describe()

       Year Graduated         Salary           Fee
count       88.000000      88.000000     88.000000
mean      2006.477273   84090.909091  11708.727273
std          1.560852   21234.128008   1110.647949
min       2004.000000   35000.000000  10869.000000
25%       2005.000000   75000.000000  10968.000000
50%       2006.500000   75000.000000  11696.000000
75%       2008.000000   90000.000000  12058.250000
max       2009.000000  160000.000000  20960.000000

#Question 3 : Cleaning the data set - part A

#a) Use clean_currency method below to strip out commas and dollar signs from Savings ($) column and put into a new column called 'Savings'.

In [12]:
alumni.head()

,Year Graduated,Gender,Marital Status,Diploma Type,Defaulted,Salary,Fee,Savings ($)
0,2004,Male,Single,Standard Diploma,Yes,125000,10869,"$86,000"
1,2005,Male,Married,College Prep Diploma,No,100000,10869,"$116,000"
2,2006,Female,Single,Standard Diploma,Yes,70000,10869,"$52,000"
3,2007,Male,Married,Standard Diploma,No,120000,10869,"$76,000"
4,2006,Female,Divorced,Standard Diploma,Yes,95000,11948,"$52,000"

def clean_currency(("Savings")):
    return float(["Savings"].replace(","," ").replace("$"," "))

clean_currency("Savings")

In [19]:
alumni['Savings'] = alumni['Savings ($)'].str.replace(',', "")
alumni['Savings'] = alumni['Savings ($)'].str.replace('$', "")
alumni['Savings']

0      86,000
1     116,000
2      52,000
3      76,000
4      52,000
       ...
83     16,000
84     72,000
85     46,000
86     32,000
87     67,000
Name: Savings, Length: 88, dtype: object

In [17]:
alumni.head()

,Year Graduated,Gender,Marital Status,Diploma Type,Defaulted,Salary,Fee,Savings ($),Savings
0,2004,Male,Single,Standard Diploma,Yes,125000,10869,"$86,000","86,000"
1,2005,Male,Married,College Prep Diploma,No,100000,10869,"$116,000","116,000"
2,2006,Female,Single,Standard Diploma,Yes,70000,10869,"$52,000","52,000"
3,2007,Male,Married,Standard Diploma,No,120000,10869,"$76,000","76,000"
4,2006,Female,Divorced,Standard Diploma,Yes,95000,11948,"$52,000","52,000"

def clean_currency("Savings"):
    return float(("Savings").replace(","," ").replace("$"," "))

clean_currency("Savings")

alumni[Savings] = clean_currency(curr)

#Uncomment 'alumni.dtypes.Savings' to check that the type change has occurred

In [20]:
alumni.dtypes.Savings

dtype('O')

##Question 4 : Cleaning the data set - part B

a) Run the 'alumni["Gender"].value_counts()' to see the incorrect 'M' fields that need to be converted to 'Male'

In [27]:
alumni["Gender"].value_counts(),('M')

(Male      46
 Female    39
 M          3
 Name: Gender, dtype: int64,
 'M')

In [35]:
alumni.info

<bound method DataFrame.info of     Year Graduated  Gender Marital Status          Diploma Type Defaulted  \
0             2004    Male         Single      Standard Diploma       Yes
1             2005    Male        Married  College Prep Diploma        No
2             2006  Female         Single      Standard Diploma       Yes
3             2007    Male        Married      Standard Diploma        No
4             2006  Female       Divorced      Standard Diploma       Yes
..             ...     ...            ...                   ...       ...
83            2007    Male         Single      Standard Diploma        No
84            2008       M         Single  College Prep Diploma       Yes
85            2009    Male        Married      Standard Diploma        No
86            2005  Female       Divorced      Standard Diploma       Yes
87            2006    Male        Married      Standard Diploma       Yes

    Salary    Fee Savings ($)  Savings
0   125000  10869     $86,000   86,000
1   100000  10869    $116,000  116,000
2    70000  10869     $52,000   52,000
3   120000  10869     $76,000   76,000
4    95000  11948     $52,000   52,000
..     ...    ...         ...      ...
83   75000  12066     $16,000   16,000
84   65000  12066     $72,000   72,000
85   75000  12066     $46,000   46,000
86  100000  12067     $32,000   32,000
87   75000  12067     $67,000   67,000

[88 rows x 9 columns]>

b) Now use a '.str.replace' on the 'Gender' column to covert the incorrect 'M' fields.
#Hint: We must use ^...$ to restrict the pattern to match the whole string.

In [56]:
alumni['Gender'] = alumni['Gender'].str.replace("M", "male", "female")
alumni['Gender'] = alumni['Gender'].str.replace("M", "Male")
alumni['Gender']

AttributeError: Can only use .str accessor with string values!

In [44]:
str = "this is string example....wow!!! this is really string"
print str.replace("is", "was")
print str.replace("is", "was", 3)

SyntaxError: invalid syntax (<ipython-input-44-cea2855b4add>, line 2)